// Механизм предназначен для 
// 
// Возвращаемое значение:
//   - 
//
Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаЭлементаПриСозданииНаСервере", Истина);
	
	Настройки.ПорядокВыполнения = 1000;
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаЭлементаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда Возврат Неопределено; КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автозадачи.Источник КАК Источник,
		|	Автозадачи.Вариант КАК Вариант,
		|	Автозадачи.Ключ КАК Ключ,
		|	Автозадачи.Параметры КАК Параметры
		|ИЗ
		|	РегистрСведений.А1Автозадачи КАК Автозадачи
		|ГДЕ
		|	Автозадачи.Задача = &ИдентификаторЗадачи";
		Запрос.УстановитьПараметр("ИдентификаторЗадачи", А1Э_Метаданные.ИдентификаторПоСсылке(Форма.Объект.Ссылка));
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда Возврат Неопределено; КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Настройка = А1Автозадачи.НастройкаВарианта(Выборка.Вариант);
		Если НЕ ЗначениеЗаполнено(Настройка.Команда) Тогда Возврат Неопределено; КонецЕсли;
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, "А1Автозадачи_ДанныеАвтозадачи", "", , , А1Э_Структуры.Создать(
		"ЗначениеРеквизита", А1Э_Структуры.Создать(
		"Источник", А1Э_Метаданные.СсылкаПоИдентификатору(Выборка.Источник),
		"Вариант", Выборка.Вариант,
		"Ключ", А1Э_Сериализация.РазвернутьУниверсальныйЖСОН(Выборка.Ключ),
		"Параметры", А1Э_Сериализация.РазвернутьУниверсальныйЖСОН(Выборка.Параметры),
		)));
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "А1Автозадачи_ФункцияВыполнения", Настройка.Команда, "Перейти к выполнению", А1Э_Формы.КоманднаяПанель(Форма));
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
	КонецФункции 
#КонецЕсли
 