Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Автозадачи");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Автозадачи_Источники");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1Автозадачи_Задачи");
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__БезОбъектов(), "А1Автозадачи");
КонецФункции

#Область ДополнительнаяИнформация
//Новые события:
//А1Автозадачи_ПриОпределенииНастроек(НастройкиАвтозадач) позволяет добавить автозадачи в систему.
//  НастройкаАвтозадач - массив, элементами которого должны являться объекты, созданные конструкторов А1Автозадачи.НовыйНастройка().
//А1Автозадачи_ПриСозданииЗадачи определяет действия, которые выполняются при создании новой задачи.
//А1Автозадачи_ПриОбновленииЗадачи определяет действия, которые выполняются при изменении параметров задачи.
//А1Автозадачи_ПриЗавершенииЗадачи определяет действия, которые выполняются при завершении задачи.

#КонецОбласти 