
// Механизм предназначен для подключения к объектам, являющимся источниками для автозадач.
// Обеспечивает автоматическое обновление автозадач в синхронном режиме.
// 
// Возвращаемое значение:
//   - 
//
Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ПриЗаписи", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ПриЗаписи(Объект, Отказ) Экспорт
		//Для ситуаций, когда обновление выполняется отдельно или вообще не выполняется по тем или иным причинам.
		Если Объект.ДополнительныеСвойства.Свойство("А1Автозадачи_НеОбновлять") Тогда Возврат Неопределено; КонецЕсли;

		А1Автозадачи.Обновить(, Объект.Ссылка); 	
	КонецФункции

#КонецЕсли
